HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxEray_regdef.h
/** \brief SUC Configuration Register 1 */
typedef struct _Ifx_ERAY_SUCC1_Bits
{
    Ifx_UReg_32Bit CMD:4;             /**< \brief [3:0] CHI Command Vector - CMD (rwh) */
    Ifx_UReg_32Bit reserved_4:3;      /**< \brief [6:4] \internal Reserved */
    Ifx_UReg_32Bit PBSY:1;            /**< \brief [7:7] POC Busy - PBSY (rh) */
    Ifx_UReg_32Bit TXST:1;            /**< \brief [8:8] Transmit Startup Frame in Key Slot  (pKeySlotUsedForStartup) - TXST (rw) */
    Ifx_UReg_32Bit TXSY:1;            /**< \brief [9:9] Transmit SYNC Frame in Key Slot (pKeySlotUsedForSync) - TXSY (rw) */
    Ifx_UReg_32Bit reserved_10:1;     /**< \brief [10:10] \internal Reserved */
    Ifx_UReg_32Bit CSA:5;             /**< \brief [15:11] Cold Start Attempts (gColdStartAttempts) - CSA (rw) */
    Ifx_UReg_32Bit PTA:5;             /**< \brief [20:16] Passive to Active (pAllowPassiveToActive) - PTA (rw) */
    Ifx_UReg_32Bit WUCS:1;            /**< \brief [21:21] Wakeup Channel Select (pWakeupChannel) - WUCS (rw) */
    Ifx_UReg_32Bit TSM:1;             /**< \brief [22:22] Transmission Slot Mode (pSingleSlotEnabled) - TSM (rw) */
    Ifx_UReg_32Bit HCSE:1;            /**< \brief [23:23] Halt due to Clock Sync Error (pAllowHaltDueToClock) - HCSE (rw) */
    Ifx_UReg_32Bit MTSA:1;            /**< \brief [24:24] Select Channel A for MTS Transmission - MTSA (rw) */
    Ifx_UReg_32Bit MTSB:1;            /**< \brief [25:25] Select Channel B for MTS Transmission - MTSB (rw) */
    Ifx_UReg_32Bit CCHA:1;            /**< \brief [26:26] Connected to Channel A (pChannels) - CCHA (rw) */
    Ifx_UReg_32Bit CCHB:1;            /**< \brief [27:27] Connected to Channel B (pChannels) - CCHB (rw) */
    Ifx_UReg_32Bit reserved_28:4;     /**< \brief [31:28] \internal Reserved */
} Ifx_ERAY_SUCC1_Bits;

/** \brief SUC Configuration Register 2 */
typedef struct _Ifx_ERAY_SUCC2_Bits
{
    Ifx_UReg_32Bit LT:21;             /**< \brief [20:0] Listen Timeout(pdListenTimeout) - LT (rw) */
    Ifx_UReg_32Bit reserved_21:3;     /**< \brief [23:21] \internal Reserved */
    Ifx_UReg_32Bit LTN:4;             /**< \brief [27:24] Listen Time-out Noise (gListenNoise - 1)  - LTN (rw) */
    Ifx_UReg_32Bit reserved_28:4;     /**< \brief [31:28] \internal Reserved */
} Ifx_ERAY_SUCC2_Bits;

/** \brief SUC Configuration Register 3 */
typedef struct _Ifx_ERAY_SUCC3_Bits
{
    Ifx_UReg_32Bit WCP:4;             /**< \brief [3:0] Maximum Without Clock Correction Passive(gMaxWithoutClockCorrectionPassive) - WCP (rw) */
    Ifx_UReg_32Bit WCF:4;             /**< \brief [7:4] Maximum Without Clock Correction Fatal (gMaxWithoutClockCorrecti on Fatal) - WCF (rw) */
    Ifx_UReg_32Bit reserved_8:24;     /**< \brief [31:8] \internal Reserved */
} Ifx_ERAY_SUCC3_Bits;

/** \brief Symbol Window and Network Idle Time Status */
typedef struct _Ifx_ERAY_SWNIT_Bits
{
    Ifx_UReg_32Bit SESA:1;            /**< \brief [0:0] Syntax Error in Symbol Window Channel A(vSS!SyntaxErrorA) - SESA (rh) */
    Ifx_UReg_32Bit SBSA:1;            /**< \brief [1:1] Slot Boundary Violation in Symbol Window Channel A(vSS!BViolationA) - SBSA (rh) */
    Ifx_UReg_32Bit TCSA:1;            /**< \brief [2:2] Transmission Conflict in Symbol Window Channel A(vSS!TxConflictA) - TCSA (rh) */
    Ifx_UReg_32Bit SESB:1;            /**< \brief [3:3] Syntax Error in Symbol Window Channel B(vSS!SyntaxErrorB) - SESB (rh) */
    Ifx_UReg_32Bit SBSB:1;            /**< \brief [4:4] Slot Boundary Violation in Symbol Window Channel B(vSS!BViolationB) - SBSB (rh) */
    Ifx_UReg_32Bit TCSB:1;            /**< \brief [5:5] Transmission Conflict in Symbol Window Channel B(vSS!TxConflictB) - TCSB (rh) */
    Ifx_UReg_32Bit MTSA:1;            /**< \brief [6:6] MTS Received on Channel A(vSS!ValidMTSA) - MTSA (rh) */
    Ifx_UReg_32Bit MTSB:1;            /**< \brief [7:7] MTS Received on Channel B(vSS!ValidMTSB) - MTSB (rh) */
    Ifx_UReg_32Bit SENA:1;            /**< \brief [8:8] Syntax Error during network idle time (NIT) Channel A(vSS!SyntaxErrorA) - SENA (rh) */
    Ifx_UReg_32Bit SBNA:1;            /**< \brief [9:9] Slot Boundary Violation during network idle time (NIT) Channel A(vSS!BViolationA) - SBNA (rh) */
    Ifx_UReg_32Bit SENB:1;            /**< \brief [10:10] Syntax Error during network idle time (NIT) Channel B(vSS!SyntaxErrorB) - SENB (rh) */
    Ifx_UReg_32Bit SBNB:1;            /**< \brief [11:11] Slot Boundary Violation during network idle time (NIT) Channel B(vSS!BViolationB) - SBNB (rh) */
    Ifx_UReg_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_ERAY_SWNIT_Bits;

/** \brief Timer 0 Configuration */
typedef struct _Ifx_ERAY_T0C_Bits
{
    Ifx_UReg_32Bit T0RC:1;            /**< \brief [0:0] Timer 0 Run Control - T0RC (rwh) */
    Ifx_UReg_32Bit T0MS:1;            /**< \brief [1:1] Timer 0 Mode Select - T0MS (rw) */
    Ifx_UReg_32Bit reserved_2:6;      /**< \brief [7:2] \internal Reserved */
    Ifx_UReg_32Bit T0CC:7;            /**< \brief [14:8] Timer 0 Cycle Code - T0CC (rw) */
    Ifx_UReg_32Bit reserved_15:1;     /**< \brief [15:15] \internal Reserved */
    Ifx_UReg_32Bit T0MO:14;           /**< \brief [29:16] Timer 0 Macrotick Offset - T0MO (rw) */
    Ifx_UReg_32Bit reserved_30:2;     /**< \brief [31:30] \internal Reserved */
} Ifx_ERAY_T0C_Bits;

/** \brief Timer 1 Configuration */
typedef struct _Ifx_ERAY_T1C_Bits
{
    Ifx_UReg_32Bit T1RC:1;            /**< \brief [0:0] Timer 1 Run Control - T1RC (rwh) */
    Ifx_UReg_32Bit T1MS:1;            /**< \brief [1:1] Timer 1 Mode Select - T1MS (rw) */
    Ifx_UReg_32Bit reserved_2:14;     /**< \brief [15:2] \internal Reserved */
    Ifx_UReg_32Bit T1MC:14;           /**< \brief [29:16] Timer 1 Macrotick Count - T1MC (rw) */
    Ifx_UReg_32Bit reserved_30:2;     /**< \brief [31:30] \internal Reserved */
} Ifx_ERAY_T1C_Bits;

/** \brief Test Register 1 */
typedef struct _Ifx_ERAY_TEST1_Bits
{
    Ifx_UReg_32Bit WRTEN:1;           /**< \brief [0:0] Write Test Register Enable - WRTEN (rw) */
    Ifx_UReg_32Bit ELBE:1;            /**< \brief [1:1] External Loop Back Enable - ELBE (rw) */
    Ifx_UReg_32Bit reserved_2:2;      /**< \brief [3:2] \internal Reserved */
    Ifx_UReg_32Bit TMC:2;             /**< \brief [5:4] Test Multiplexer Control - TMC (rw) */
    Ifx_UReg_32Bit reserved_6:2;      /**< \brief [7:6] \internal Reserved */
    Ifx_UReg_32Bit AOA:1;             /**< \brief [8:8] Activity on A - AOA (rh) */
    Ifx_UReg_32Bit AOB:1;             /**< \brief [9:9] Activity on B - AOB (rh) */
    Ifx_UReg_32Bit reserved_10:6;     /**< \brief [15:10] \internal Reserved */
    Ifx_UReg_32Bit RXA:1;             /**< \brief [16:16] Read Channel A Receive Pin - RXA (rh) */
    Ifx_UReg_32Bit RXB:1;             /**< \brief [17:17] Read Channel B Receive Pin - RXB (rh) */
    Ifx_UReg_32Bit TXA:1;             /**< \brief [18:18] Read or Write to Channel A Transmit Pin - TXA (rwh) */
    Ifx_UReg_32Bit TXB:1;             /**< \brief [19:19] Read or Write to Channel B Transmit Pin - TXB (rwh) */
    Ifx_UReg_32Bit TXENA:1;           /**< \brief [20:20] Read or Write to Channel A Transmit Enable Pin - TXENA (rwh) */
    Ifx_UReg_32Bit TXENB:1;           /**< \brief [21:21] Read or Write to Channel B Transmit Enable Pin - TXENB (rwh) */
    Ifx_UReg_32Bit reserved_22:2;     /**< \brief [23:22] \internal Reserved */
    Ifx_UReg_32Bit CERA:4;            /**< \brief [27:24] Coding Error Report Channel A - CERA (rh) */
    Ifx_UReg_32Bit CERB:4;            /**< \brief [31:28] Coding Error Report Channel B  - CERB (rh) */
} Ifx_ERAY_TEST1_Bits;

/** \brief Test Register 2 */
typedef struct _Ifx_ERAY_TEST2_Bits
{
    Ifx_UReg_32Bit RS:3;              /**< \brief [2:0] RAM Select - RS (rw) */
    Ifx_UReg_32Bit reserved_3:1;      /**< \brief [3:3] \internal Reserved */
    Ifx_UReg_32Bit SSEL:3;            /**< \brief [6:4] Segment Select - SSEL (rw) */
    Ifx_UReg_32Bit reserved_7:7;      /**< \brief [13:7] \internal Reserved */
    Ifx_UReg_32Bit WRECC:1;           /**< \brief [14:14] Write ECC Data Enable - WRECC (rw) */
    Ifx_UReg_32Bit reserved_15:1;     /**< \brief [15:15] \internal Reserved */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_ERAY_TEST2_Bits;

/** \brief Transmission Request Register 1 */
typedef struct _Ifx_ERAY_TXRQ1_Bits
{
    Ifx_UReg_32Bit TXR0:1;            /**< \brief [0:0] Transmission Request 0 (n = 0-31) - TXR0 (rh) */
    Ifx_UReg_32Bit TXR1:1;            /**< \brief [1:1] Transmission Request 1 (n = 0-31) - TXR1 (rh) */
    Ifx_UReg_32Bit TXR2:1;            /**< \brief [2:2] Transmission Request 2 (n = 0-31) - TXR2 (rh) */
    Ifx_UReg_32Bit TXR3:1;            /**< \brief [3:3] Transmission Request 3 (n = 0-31) - TXR3 (rh) */
    Ifx_UReg_32Bit TXR4:1;            /**< \brief [4:4] Transmission Request 4 (n = 0-31) - TXR4 (rh) */
    Ifx_UReg_32Bit TXR5:1;            /**< \brief [5:5] Transmission Request 5 (n = 0-31) - TXR5 (rh) */
    Ifx_UReg_32Bit TXR6:1;            /**< \brief [6:6] Transmission Request 6 (n = 0-31) - TXR6 (rh) */
    Ifx_UReg_32Bit TXR7:1;            /**< \brief [7:7] Transmission Request 7 (n = 0-31) - TXR7 (rh) */
    Ifx_UReg_32Bit TXR8:1;            /**< \brief [8:8] Transmission Request 8 (n = 0-31) - TXR8 (rh) */
    Ifx_UReg_32Bit TXR9:1;            /**< \brief [9:9] Transmission Request 9 (n = 0-31) - TXR9 (rh) */
    Ifx_UReg_32Bit TXR10:1;           /**< \brief [10:10] Transmission Request 10 (n = 0-31) - TXR10 (rh) */
    Ifx_UReg_32Bit TXR11:1;           /**< \brief [11:11] Transmission Request 11 (n = 0-31) - TXR11 (rh) */
    Ifx_UReg_32Bit TXR12:1;           /**< \brief [12:12] Transmission Request 12 (n = 0-31) - TXR12 (rh) */
    Ifx_UReg_32Bit TXR13:1;           /**< \brief [13:13] Transmission Request 13 (n = 0-31) - TXR13 (rh) */
    Ifx_UReg_32Bit TXR14:1;           /**< \brief [14:14] Transmission Request 14 (n = 0-31) - TXR14 (rh) */
    Ifx_UReg_32Bit TXR15:1;           /**< \brief [15:15] Transmission Request 15 (n = 0-31) - TXR15 (rh) */
    Ifx_UReg_32Bit TXR16:1;           /**< \brief [16:16] Transmission Request 16 (n = 0-31) - TXR16 (rh) */
    Ifx_UReg_32Bit TXR17:1;           /**< \brief [17:17] Transmission Request 17 (n = 0-31) - TXR17 (rh) */
    Ifx_UReg_32Bit TXR18:1;           /**< \brief [18:18] Transmission Request 18 (n = 0-31) - TXR18 (rh) */
    Ifx_UReg_32Bit TXR19:1;           /**< \brief [19:19] Transmission Request 19 (n = 0-31) - TXR19 (rh) */
    Ifx_UReg_32Bit TXR20:1;           /**< \brief [20:20] Transmission Request 20 (n = 0-31) - TXR20 (rh) */
    Ifx_UReg_32Bit TXR21:1;           /**< \brief [21:21] Transmission Request 21 (n = 0-31) - TXR21 (rh) */
    Ifx_UReg_32Bit TXR22:1;           /**< \brief [22:22] Transmission Request 22 (n = 0-31) - TXR22 (rh) */
    Ifx_UReg_32Bit TXR23:1;           /**< \brief [23:23] Transmission Request 23 (n = 0-31) - TXR23 (rh) */
    Ifx_UReg_32Bit TXR24:1;           /**< \brief [24:24] Transmission Request 24 (n = 0-31) - TXR24 (rh) */
    Ifx_UReg_32Bit TXR25:1;           /**< \brief [25:25] Transmission Request 25 (n = 0-31) - TXR25 (rh) */
    Ifx_UReg_32Bit TXR26:1;           /**< \brief [26:26] Transmission Request 26 (n = 0-31) - TXR26 (rh) */
    Ifx_UReg_32Bit TXR27:1;           /**< \brief [27:27] Transmission Request 27 (n = 0-31) - TXR27 (rh) */
    Ifx_UReg_32Bit TXR28:1;           /**< \brief [28:28] Transmission Request 28 (n = 0-31) - TXR28 (rh) */
    Ifx_UReg_32Bit TXR29:1;           /**< \brief [29:29] Transmission Request 29 (n = 0-31) - TXR29 (rh) */
    Ifx_UReg_32Bit TXR30:1;           /**< \brief [30:30] Transmission Request 30 (n = 0-31) - TXR30 (rh) */
    Ifx_UReg_32Bit TXR31:1;           /**< \brief [31:31] Transmission Request 31 (n = 0-31) - TXR31 (rh) */
} Ifx_ERAY_TXRQ1_Bits;

/** \brief Transmission Request Register 2 */
typedef struct _Ifx_ERAY_TXRQ2_Bits
{
    Ifx_UReg_32Bit TXR32:1;           /**< \brief [0:0] Transmission Request 32 (n = 32-63) - TXR32 (rh) */
    Ifx_UReg_32Bit TXR33:1;           /**< \brief [1:1] Transmission Request 33 (n = 32-63) - TXR33 (rh) */
    Ifx_UReg_32Bit TXR34:1;           /**< \brief [2:2] Transmission Request 34 (n = 32-63) - TXR34 (rh) */
    Ifx_UReg_32Bit TXR35:1;           /**< \brief [3:3] Transmission Request 35 (n = 32-63) - TXR35 (rh) */
    Ifx_UReg_32Bit TXR36:1;           /**< \brief [4:4] Transmission Request 36 (n = 32-63) - TXR36 (rh) */
    Ifx_UReg_32Bit TXR37:1;           /**< \brief [5:5] Transmission Request 37 (n = 32-63) - TXR37 (rh) */
    Ifx_UReg_32Bit TXR38:1;           /**< \brief [6:6] Transmission Request 38 (n = 32-63) - TXR38 (rh) */
    Ifx_UReg_32Bit TXR39:1;           /**< \brief [7:7] Transmission Request 39 (n = 32-63) - TXR39 (rh) */
    Ifx_UReg_32Bit TXR40:1;           /**< \brief [8:8] Transmission Request 40 (n = 32-63) - TXR40 (rh) */
    Ifx_UReg_32Bit TXR41:1;           /**< \brief [9:9] Transmission Request 41 (n = 32-63) - TXR41 (rh) */
    Ifx_UReg_32Bit TXR42:1;           /**< \brief [10:10] Transmission Request 42 (n = 32-63) - TXR42 (rh) */
    Ifx_UReg_32Bit TXR43:1;           /**< \brief [11:11] Transmission Request 43 (n = 32-63) - TXR43 (rh) */
    Ifx_UReg_32Bit TXR44:1;           /**< \brief [12:12] Transmission Request 44 (n = 32-63) - TXR44 (rh) */
    Ifx_UReg_32Bit TXR45:1;           /**< \brief [13:13] Transmission Request 45 (n = 32-63) - TXR45 (rh) */
    Ifx_UReg_32Bit TXR46:1;           /**< \brief [14:14] Transmission Request 46 (n = 32-63) - TXR46 (rh) */
    Ifx_UReg_32Bit TXR47:1;           /**< \brief [15:15] Transmission Request 47 (n = 32-63) - TXR47 (rh) */
    Ifx_UReg_32Bit TXR48:1;           /**< \brief [16:16] Transmission Request 48 (n = 32-63) - TXR48 (rh) */
    Ifx_UReg_32Bit TXR49:1;           /**< \brief [17:17] Transmission Request 49 (n = 32-63) - TXR49 (rh) */
    Ifx_UReg_32Bit TXR50:1;           /**< \brief [18:18] Transmission Request 50 (n = 32-63) - TXR50 (rh) */
    Ifx_UReg_32Bit TXR51:1;           /**< \brief [19:19] Transmission Request 51 (n = 32-63) - TXR51 (rh) */
    Ifx_UReg_32Bit TXR52:1;           /**< \brief [20:20] Transmission Request 52 (n = 32-63) - TXR52 (rh) */
    Ifx_UReg_32Bit TXR53:1;           /**< \brief [21:21] Transmission Request 53 (n = 32-63) - TXR53 (rh) */
    Ifx_UReg_32Bit TXR54:1;           /**< \brief [22:22] Transmission Request 54 (n = 32-63) - TXR54 (rh) */
    Ifx_UReg_32Bit TXR55:1;           /**< \brief [23:23] Transmission Request 55 (n = 32-63) - TXR55 (rh) */
    Ifx_UReg_32Bit TXR56:1;           /**< \brief [24:24] Transmission Request 56 (n = 32-63) - TXR56 (rh) */
    Ifx_UReg_32Bit TXR57:1;           /**< \brief [25:25] Transmission Request 57 (n = 32-63) - TXR57 (rh) */
    Ifx_UReg_32Bit TXR58:1;           /**< \brief [26:26] Transmission Request 58 (n = 32-63) - TXR58 (rh) */
    Ifx_UReg_32Bit TXR59:1;           /**< \brief [27:27] Transmission Request 59 (n = 32-63) - TXR59 (rh) */
    Ifx_UReg_32Bit TXR60:1;           /**< \brief [28:28] Transmission Request 60 (n = 32-63) - TXR60 (rh) */
    Ifx_UReg_32Bit TXR61:1;           /**< \brief [29:29] Transmission Request 61 (n = 32-63) - TXR61 (rh) */
    Ifx_UReg_32Bit TXR62:1;           /**< \brief [30:30] Transmission Request 62 (n = 32-63) - TXR62 (rh) */
    Ifx_UReg_32Bit TXR63:1;           /**< \brief [31:31] Transmission Request 63 (n = 32-63) - TXR63 (rh) */
} Ifx_ERAY_TXRQ2_Bits;

/** \brief Transmission Request Register 3 */
typedef struct _Ifx_ERAY_TXRQ3_Bits
{
    Ifx_UReg_32Bit TXR64:1;           /**< \brief [0:0] Transmission Request 64 (n = 64-95) - TXR64 (rh) */
    Ifx_UReg_32Bit TXR65:1;           /**< \brief [1:1] Transmission Request 65 (n = 64-95) - TXR65 (rh) */
    Ifx_UReg_32Bit TXR66:1;           /**< \brief [2:2] Transmission Request 66 (n = 64-95) - TXR66 (rh) */
    Ifx_UReg_32Bit TXR67:1;           /**< \brief [3:3] Transmission Request 67 (n = 64-95) - TXR67 (rh) */
    Ifx_UReg_32Bit TXR68:1;           /**< \brief [4:4] Transmission Request 68 (n = 64-95) - TXR68 (rh) */
    Ifx_UReg_32Bit TXR69:1;           /**< \brief [5:5] Transmission Request 69 (n = 64-95) - TXR69 (rh) */
    Ifx_UReg_32Bit TXR70:1;           /**< \brief [6:6] Transmission Request 70 (n = 64-95) - TXR70 (rh) */
    Ifx_UReg_32Bit TXR71:1;           /**< \brief [7:7] Transmission Request 71 (n = 64-95) - TXR71 (rh) */
    Ifx_UReg_32Bit TXR72:1;           /**< \brief [8:8] Transmission Request 72 (n = 64-95) - TXR72 (rh) */
    Ifx_UReg_32Bit TXR73:1;           /**< \brief [9:9] Transmission Request 73 (n = 64-95) - TXR73 (rh) */
    Ifx_UReg_32Bit TXR74:1;           /**< \brief [10:10] Transmission Request 74 (n = 64-95) - TXR74 (rh) */
    Ifx_UReg_32Bit TXR75:1;           /**< \brief [11:11] Transmission Request 75 (n = 64-95) - TXR75 (rh) */
    Ifx_UReg_32Bit TXR76:1;           /**< \brief [12:12] Transmission Request 76 (n = 64-95) - TXR76 (rh) */
    Ifx_UReg_32Bit TXR77:1;           /**< \brief [13:13] Transmission Request 77 (n = 64-95) - TXR77 (rh) */
    Ifx_UReg_32Bit TXR78:1;           /**< \brief [14:14] Transmission Request 78 (n = 64-95) - TXR78 (rh) */
    Ifx_UReg_32Bit TXR79:1;           /**< \brief [15:15] Transmission Request 79 (n = 64-95) - TXR79 (rh) */
    Ifx_UReg_32Bit TXR80:1;           /**< \brief [16:16] Transmission Request 80 (n = 64-95) - TXR80 (rh) */
    Ifx_UReg_32Bit TXR81:1;           /**< \brief [17:17] Transmission Request 81 (n = 64-95) - TXR81 (rh) */
    Ifx_UReg_32Bit TXR82:1;           /**< \brief [18:18] Transmission Request 82 (n = 64-95) - TXR82 (rh) */
    Ifx_UReg_32Bit TXR83:1;           /**< \brief [19:19] Transmission Request 83 (n = 64-95) - TXR83 (rh) */
    Ifx_UReg_32Bit TXR84:1;           /**< \brief [20:20] Transmission Request 84 (n = 64-95) - TXR84 (rh) */
    Ifx_UReg_32Bit TXR85:1;           /**< \brief [21:21] Transmission Request 85 (n = 64-95) - TXR85 (rh) */
    Ifx_UReg_32Bit TXR86:1;           /**< \brief [22:22] Transmission Request 86 (n = 64-95) - TXR86 (rh) */
    Ifx_UReg_32Bit TXR87:1;           /**< \brief [23:23] Transmission Request 87 (n = 64-95) - TXR87 (rh) */
    Ifx_UReg_32Bit TXR88:1;           /**< \brief [24:24] Transmission Request 88 (n = 64-95) - TXR88 (rh) */
    Ifx_UReg_32Bit TXR89:1;           /**< \brief [25:25] Transmission Request 89 (n = 64-95) - TXR89 (rh) */
    Ifx_UReg_32Bit TXR90:1;           /**< \brief [26:26] Transmission Request 90 (n = 64-95) - TXR90 (rh) */
    Ifx_UReg_32Bit TXR91:1;           /**< \brief [27:27] Transmission Request 91 (n = 64-95) - TXR91 (rh) */
    Ifx_UReg_32Bit TXR92:1;           /**< \brief [28:28] Transmission Request 92 (n = 64-95) - TXR92 (rh) */
    Ifx_UReg_32Bit TXR93:1;           /**< \brief [29:29] Transmission Request 93 (n = 64-95) - TXR93 (rh) */
    Ifx_UReg_32Bit TXR94:1;           /**< \brief [30:30] Transmission Request 94 (n = 64-95) - TXR94 (rh) */
    Ifx_UReg_32Bit TXR95:1;           /**< \brief [31:31] Transmission Request 95 (n = 64-95) - TXR95 (rh) */
} Ifx_ERAY_TXRQ3_Bits;

/** \brief Transmission Request Register 4 */
typedef struct _Ifx_ERAY_TXRQ4_Bits
{
    Ifx_UReg_32Bit TXR96:1;           /**< \brief [0:0] Transmission Request 96 (n = 96-127) - TXR96 (rh) */
    Ifx_UReg_32Bit TXR97:1;           /**< \brief [1:1] Transmission Request 97 (n = 96-127) - TXR97 (rh) */
    Ifx_UReg_32Bit TXR98:1;           /**< \brief [2:2] Transmission Request 98 (n = 96-127) - TXR98 (rh) */
    Ifx_UReg_32Bit TXR99:1;           /**< \brief [3:3] Transmission Request 99 (n = 96-127) - TXR99 (rh) */
    Ifx_UReg_32Bit TXR100:1;          /**< \brief [4:4] Transmission Request 100 (n = 96-127) - TXR100 (rh) */
    Ifx_UReg_32Bit TXR101:1;          /**< \brief [5:5] Transmission Request 101 (n = 96-127) - TXR101 (rh) */
    Ifx_UReg_32Bit TXR102:1;          /**< \brief [6:6] Transmission Request 102 (n = 96-127) - TXR102 (rh) */
    Ifx_UReg_32Bit TXR103:1;          /**< \brief [7:7] Transmission Request 103 (n = 96-127) - TXR103 (rh) */
    Ifx_UReg_32Bit TXR104:1;          /**< \brief [8:8] Transmission Request 104 (n = 96-127) - TXR104 (rh) */
    Ifx_UReg_32Bit TXR105:1;          /**< \brief [9:9] Transmission Request 105 (n = 96-127) - TXR105 (rh) */
    Ifx_UReg_32Bit TXR106:1;          /**< \brief [10:10] Transmission Request 106 (n = 96-127) - TXR106 (rh) */
    Ifx_UReg_32Bit TXR107:1;          /**< \brief [11:11] Transmission Request 107 (n = 96-127) - TXR107 (rh) */
    Ifx_UReg_32Bit TXR108:1;          /**< \brief [12:12] Transmission Request 108 (n = 96-127) - TXR108 (rh) */
    Ifx_UReg_32Bit TXR109:1;          /**< \brief [13:13] Transmission Request 109 (n = 96-127) - TXR109 (rh) */
    Ifx_UReg_32Bit TXR110:1;          /**< \brief [14:14] Transmission Request 110 (n = 96-127) - TXR110 (rh) */
    Ifx_UReg_32Bit TXR111:1;          /**< \brief [15:15] Transmission Request 111 (n = 96-127) - TXR111 (rh) */
    Ifx_UReg_32Bit TXR112:1;          /**< \brief [16:16] Transmission Request 112 (n = 96-127) - TXR112 (rh) */
    Ifx_UReg_32Bit TXR113:1;          /**< \brief [17:17] Transmission Request 113 (n = 96-127) - TXR113 (rh) */
    Ifx_UReg_32Bit TXR114:1;          /**< \brief [18:18] Transmission Request 114 (n = 96-127) - TXR114 (rh) */
    Ifx_UReg_32Bit TXR115:1;          /**< \brief [19:19] Transmission Request 115 (n = 96-127) - TXR115 (rh) */
    Ifx_UReg_32Bit TXR116:1;          /**< \brief [20:20] Transmission Request 116 (n = 96-127) - TXR116 (rh) */
    Ifx_UReg_32Bit TXR117:1;          /**< \brief [21:21] Transmission Request 117 (n = 96-127) - TXR117 (rh) */
    Ifx_UReg_32Bit TXR118:1;          /**< \brief [22:22] Transmission Request 118 (n = 96-127) - TXR118 (rh) */
    Ifx_UReg_32Bit TXR119:1;          /**< \brief [23:23] Transmission Request 119 (n = 96-127) - TXR119 (rh) */
    Ifx_UReg_32Bit TXR120:1;          /**< \brief [24:24] Transmission Request 120 (n = 96-127) - TXR120 (rh) */
    Ifx_UReg_32Bit TXR121:1;          /**< \brief [25:25] Transmission Request 121 (n = 96-127) - TXR121 (rh) */
    Ifx_UReg_32Bit TXR122:1;          /**< \brief [26:26] Transmission Request 122 (n = 96-127) - TXR122 (rh) */
    Ifx_UReg_32Bit TXR123:1;          /**< \brief [27:27] Transmission Request 123 (n = 96-127) - TXR123 (rh) */
    Ifx_UReg_32Bit TXR124:1;          /**< \brief [28:28] Transmission Request 124 (n = 96-127) - TXR124 (rh) */
    Ifx_UReg_32Bit TXR125:1;          /**< \brief [29:29] Transmission Request 125 (n = 96-127) - TXR125 (rh) */
    Ifx_UReg_32Bit TXR126:1;          /**< \brief [30:30] Transmission Request 126 (n = 96-127) - TXR126 (rh) */
    Ifx_UReg_32Bit TXR127:1;          /**< \brief [31:31] Transmission Request 127 (n = 96-127) - TXR127 (rh) */
} Ifx_ERAY_TXRQ4_Bits;

/** \brief Write Data Section ${n} */
typedef struct _Ifx_ERAY_WRDS_Bits
{
    Ifx_UReg_32Bit MDWB0:8;           /**< \brief [7:0] 32-Bit Word nn, Byte 0 - MDWB0 (rw) */
    Ifx_UReg_32Bit MDWB1:8;           /**< \brief [15:8] 32-Bit Word nn, Byte 1 - MDWB1 (rw) */
    Ifx_UReg_32Bit MDWB2:8;           /**< \brief [23:16] 32-Bit Word nn, Byte 2 - MDWB2 (rw) */
    Ifx_UReg_32Bit MDWB3:8;           /**< \brief [31:24] 32-Bit Word nn, Byte 3 - MDWB3 (rw) */
} Ifx_ERAY_WRDS_Bits;

